app/controllers/alumni_controller.rb

  def home
    if current_user.course == nil
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]