app/controllers/groups_controller.rb

  def index
    if current_user.role == 1 && !current_user.group && current_user.course
---
SELECT "groups".* FROM "groups"