app/controllers/grupos_controller.rb

SELECT "grupos".* FROM "grupos"
---
  def index
    @grupo = Grupo.all